Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN God of High School.tmx
Source language: ko
Languages: en

source: 동작패턴 분석완료
en: analysis of movement pattern complete.

source: 미안~
en: sorry about that!

source: 너...
en: you’re...

source: 쿨럭!
en: ack!

source: 이동네 최고 미친놈은 나야.
en: ...i’m even worse.

source: 방주가...?!
en: the arks...?!

source: 사탄과 싸우는 동시에 이쪽도 계속 견제한다!
en: he’s keeping us in check while fighting satan at the same time!

source: 사탄도 하지 못했던 걸?
en: something not even satan was able to do?

source: 차원의 중첩?
en: are multiple dimensions overlapping each other?

source: 모든건...
en: everything...

source: 선지자 고기를!
en: find the prophet’s flesh!

source: 선지자?!
en: a prophet?!

source: 고맙다 진모리...
en: thanks, mori...

source: 지끈!
en: throb

source: 어떻게...
en: how could you...

source: 확{j}푸
en: whoosh{j}

source: 모두의 힘을...
en: i’ll give it all to you...

source: 모두들 들어줘.
en: hear me out, everyone.

source: 피
en: shwap

source: 筋斗雲
en: geundoowun.

source: 우리 때문에 힘을 다 못쓰는거지?
en: you’re not using your full power because of us, right?

source: ‘거짓말’은 아냐.
en: i wasn’t lying.

source: 같이 살자!
en: we want to live too!

source: 이거.
en: here.

source: 그날은 도적처럼 오리니...{j}항상 식장하고 깨어있으라...
en: on the appointed day, he shall come like a thief in the night,{j}so be wary at all times...

source: 콰드득
en: chomp

source: 태초에 두명의 신이 있었다.
en: in the beginning, there were two gods.

source: 집에 가는길에...{j}때마침 녀석들이 지나가서...
en: {j}ON MY WAY HOME... I HAPPENED TO RUN INTO THESE GUYS.

source: 무기의 사용자가...
en: the weapon’s user...

source: 덕분에 마음놓고 공격할 수 있어.
en: thanks to that, I don’t have to hold back.

source: 팬카페 http://cafe.naver.com/pyjssennpm
en: fan page http://cafe.naver.com/pyjssennpm

source: 거짓말쟁이라니까
en: you really are just a liar.

source: 모두 엎드려!
en: everyone down!

source: 기껏해야 토착신의 말같지 않은 예언...
en: tathagata, your life is too noble

source: 이건...
en: this is...

source: 빠득
en: crack

source: 도대체 무슨일이 벌어지고 있길래...{j}밤인데도 이렇게 밝아...
en: what exactly is going on for it to be this bright at night...?{j}

source: 츠츠츳
en: chh chhh

source: 응!!
en: okay!!!

source: 좌표를 공유해줘.{j}몸빵은 내가 할테니.
en: give me the coordinates. I'll be both the bait and the tank...{j}

source: 주변 사람부터 대피시키자.
en: let’s evacuate the people nearest to us first.

source: 또옥
en: plip

source: 이쪽은 여래도 제천도 미쳤어!
en: both the jaecheon and the tathagata here are ridiculous!

source: 허나.
en: but...

source: 무한재생
en: INFINITE REGENERATION

source: 모든건...{j}이 아이의 선택에 달렸어...
en: everything hinges on the baby’s decision...{j}

source: 꿈틀
en: twitch

source: 쓸데없는 건 없어.
en: nothing’s useless.

source: 무투는 곧 차력.
en: martial arts is borrowed power.

source: 내 아들...
en: that’s my son...

source: X세대
en: generation x

source: 여래의 무기는 총 8개 그중에 6,7번 무기는 사용하지 않았어.
en: out of his eight weapons, tathagata never used the 6th and 7th.

source: 와...
en: wow...

source: 거~더럽게 많네!
en: ugh, there’s so many of them!

source: 작살 내버릴께.
en: with the power you all gave me.

source: 아부....
en: dada...

source: 스{j}으{j}으{j}으{j}으
en: shhhh{j}{j}{j}{j}

source: 어때?
en: what did you think?

source: 우린 신경쓰지마!
en: don't worry about us!

source: 네 빈자리 매꾸느라 애먹었음.
en: it was tough trying to fill the hole you left behind.

source: 강해...!
en: it’s strong...!

source: 꽉잡아!
en: hold on tight!

source: 또..
en: again...

source: 우리는 걱정하지마.
en: don’t worry about us.

source: 뭐?
en: what?

source: 그극
en: crack

source: 나 스스로 그 죽음에 뛰어들리니, 부디 내 공석으로 혼란이 발생하지 않길 바랄뿐.
en: I choose this death myself. i only hope that chaos will not ensue in my absence.

source: 퓻
en: pshhh

source: 쿠오오
en: loom

source: 웃기지마라!
en: don’t make me laugh!

source: 배고파...
en: I’m hungry...

source: 저런걸...{j}상대하겠다고?!
en: he's going to fight... that?{j}

source: 너...!{j}여래구나!{j}모!
en: you’re tathagata, aren’t you?!

source: 시끄러.
en: shut up.

source: 끄응...
en: hngh

source: 헉...
en: huff

source: 파슛
en: splurt

source: 헤일로 발현
en: halo manifestation

source: 에너지는 사라지는게 아니라, 다른 어디론가 전이 되는 것.
en: energy doesn’t disappear. it’s just passed on to something else.

source: 하지만 나는 거부한다
en: but i refuse.

source: 더 높은곳으로 올라가 봐야겠다는 생각이 불현듯 머릿속을 스쳤다.
en: ...the thought of climbing higher suddenly crossed his mind.

source: 나쁘지 않군.{j}그 ‘업’이란거...
en: this karma thing... isn’t bad.

source: 팟
en: swoosh

source: 파앙
en: jump

source: 그래서 넌 신들을 다 잡은 후 스스로 목숨을 끊으려 하는거지?
en: that’s why you tried to kill yourself after you got rid of the gods, right?

source: 무슨일이?
en: what’s happening?

source: 저리가!
en: leave us alone!

source: 쌌어!!
en: her diaper!

source: 게다가 저건...!
en: and what’s more, that’s...!

source: 형님!{j}인사 오지게 박습니다!
en: hello, sir!{j}

source: 스스로 절대신에게 바치는 번제의 제물로 ...
en: he shall offer himself as a sacrifice to the supreme god...

source: 이건...{j}대체...
en: what exactly...{j}

source: 녀석과 일직선상에 있지마!
en: don’t stay in his line of sight!

source: 또...{j}그때처럼 지켜보기만 하라고...?
en: {j}sit back and watch again... like last time...?

source: 번{j}쩍
en: flash{j}

source: 우린 걱정하지마쇼!
en: don’t ya worry about us!

source: 지금!
en: now!

source: 안좋은 기억이...
en: a bad memory...

source: “아프지마.”
en: feel better.

source: 콰{j}콰{j}콰
en: rumble{j}{j}

source: 살아...있었느냐...
en: were... you alive...?

source: 푸하!
en: pffft!

source: 부르고 있어...
en: calling me...

source: 터덩
en: whack

source: 두근
en: thump

source: 우마왕 너처럼.
en: ...when i’m with you, king uma.

source: 응?!
en: huh?!

source: 움직여...
en: move...

source: 타인을 위한 최초의 희생
en: his first sacrifice for someone else.

source: 부피가 커진만큼 내구도가 떨어져!
en: it's bigger, so it won't be as durable!

source: 555화
en: episode 555

source: 살아...{j}난...건가?
en: {j}have i... come back to life?

source: 아...
en: ah...

source: 푸{j}확
en: whoosh{j}

source: 눈에 물 튀었어!
en: water got in my eyes!

source: 쭈우욱
en: stretch

source: 넌 그냥 네 복수놀이를 하고 싶은 것 뿐이야!
en: the only thing you want is revenge!

source: 파워만 커졌지, 상대하기엔 박무봉쪽이 훨씬 까다로워!
en: you have more power, but that’s it! mubong was much harder to deal with!

source: 기잉
en: whing

source: 캉{j}파
en: WHOOSH{j}

source: 이 아이의 선택에 달렸어...
en: hinges on the baby’s decision...

source: 자...
en: here...

source: 거기 까진거군...
en: looks like this is his limit...

source: 551화
en: episode 551

source: 감싸 안아 ‘근두운’
en: surround them, geundoowun.

source: 정말 예전의 힘을 되찾은건가?
en: did he really get his original strength back?

source: 얼른 끝내고, 돌아갈래
en: I wanna get this over with and go home.

source: 완전히 나갔어.
en: is completely unusable.

source: 오..빠?
en: mori...?

source: 예언에 나오는...{j}절대신으로의 각성을 시작하자...
en: let us awaken... as the supreme god from the prophecy...{j}

source: 다음 1천계신은 누구지?
en: who will be the next master of the first heavenly realm?

source: 여래의 요정이여...
en: ...fairies of tathagata...

source: 치이이
en: fshhh

source: 빛
en: light

source: 파사삭
en: crumble

source: 가가각
en: krrrk

source: 푸{j}욱
en: {j}stab

source: 살아있었구나...
en: you were alive...

source: 살아...{j}난건가?
en: have i come back... to life?{j}

source: 기적이야...
en: it’s a miracle...

source: 눈이 아직 살아있구나.
en: you still haven’t given up.

source: 지금 사탄의 눈에 비치는
en: right now, in satan’s eyes...

source: 건방진..!!
en: you cocky little...!!!

source: 너도 먹지 않았느냐?{j}삼장의 고기를?!{j}그것도 산채로 씹어서!
en: did you not eat it, too? xuanzang’s flesh, that is?! you chewed her up alive!

source: 신화?{j}예언?{j}알게뭐야?
en: myths? prophecies? who cares about that?{j}{j}

source: 오빠는...{j}지금껏 이런 적들과 싸워왔다는거야?!
en: {j}has mori... been fighting enemies this strong?!

source: 이 느낌이 ‘예감’인지 ‘예지’인지는 곧 밝혀지겠지...
en: i guess we’ll see if this feeling was a hunch or a vision soon...

source: 욕망의 방향을 극단적으로 부추기지.
en: ...but it can fan the flames of your desire to an extreme degree.

source: 큭...
en: ugh...

source: 쩌{j}억
en: bam{j}

source: 그 신화의 시작점에...
en: and standing at the center of it all...

source: 인생 첫 패배
en: first ever defeat

source: 여섯번째 문자 여정 군체
en: fairy colony of the 6th letter.

source: 으득
en: munch

source: 단아한!
en: ahan!

source: 설령 먹어치웠다 하더라도 이대로 물러날까?
en: and even if you did swallow him, do you think he’ll just back off?

source: 키이이잉
en: whing

source: 너희 둘 닯았구ㅊ나...
en: you two are alike...

source: 콰슉
en: kwoosh

source: 자신은 물론이고, 인간 전체의 구원이 욕망이라니!!
en: to think your deepest desire wasn’t just your own salvation, but humanity’s!!!

source: 언뜻 무작위처럼 보이지만...
en: on the surface, they seem to be moving randomly...

source: ...{j}오,오빠..
en: {j}m-mori...

source: 자신의 부활까지 점지한 자인데?
en: when he predicted his own revival?

source: 좌표를 공유해줘.{j}몸빵과 유인은 내가 할테니...
en: give me the coordinates. I'll be both the bait and the tank...{j}

source: 힘이 필요해.
en: i need power.

source: 가슈!
en: go,

source: 후우~
en: whew...

source: 요점이 뭐지?
en: what’s your point?

source: 무슨일이...
en: what’s...

source: 중간계에...
en: when i was in the...

source: 신세계 시간멈춤 완료.
en: the new world’s time is stopped.

source: 드{j}
en: crack{j}

source: 수많은 사람들의 목숨을 담보로 여기까지 왔음...
en: countless people had to die for us to get here...

source: 이 많은걸 다 정밀 타격을 한다고?
en: you’re going to do this many precise strikes?

source: 읏!
en: ugh!

source: 미래시로...
en: in your visions...

source: 이해를 넘어선 괴이
en: ...something that was beyond my understanding.

source: 넌...꼭 지켜내라!
en: protect... your world!

source: 한명 한명이 또다른 가능성의 ‘나’
en: every single one is a version of me I could’ve become.

source: 제발
en: please

source: 일곱번째 문자 조각
en: fragment of the 7th letter’s

source: 보통 사람한텐 그림자나 비칠까?
en: can normal people even glimpse your shadow?

source: 더, 더, 더 더 많이 쎄게...
en: more and more and more... even more power...

source: 미친!!
en: damn you!!!

source: 빠져...나가...
en: is draining out of me...

source: 넌그냥 내가 시키는대로만 움직여!{j}주도권은 나한테 있어!
en: just do what I tell you to! I’m the one in control here!{j}

source: 빠드득
en: crunch

source: 기쁘구나.
en: I’m glad.

source: 피핏
en: fwip

source: 더..
en: more...

source: 기대가 너무 컸나?
en: were my expectations too high?

source: 난...
en: i...

source: 557화
en: episode 557

source: 별들의 모든 빛을...{j}흡수한다?
en: he’s... absorbing all of the light from the stars?{j}

source: 네가 이 아이를 데려가는게, 최선의 선택이야.
en: you taking the baby gives us our best chance.

source: 벌레?
en: a bug?

source: 아까보단 훨씬 낫지!
en: it’s much better than a minute ago!

source: 얘전에 묻었던...{j}여래의 육편이...{j}침식한다?!
en: the fragment of tathagata that was buried in his body... is eating away at him?!{j}{j}

source: ...진
en: ...jin.

source: 즈으응
en: whoosh

source: 어서!
en: hurry!

source: 두 사람에게 모든 힘을 몰아줘.
en: send all of our power to those two.

source: 일어나.
en: get up.

source: 넌 네 의지로 신으로 각성했다고 생각 하고 있지?
en: you think you became a god of your own free will, don’t you?

source: 선지자 고기만 씹어먹으면...!
en: if I can just eat the prophet’s flesh...!

source: 자!
en: okay!

source: 너도 졌다
en: and so did you.

source: 아니...
en: no...

source: 고맙...구나...
en: thank you for staying alive...

source: 발...자국?
en: a footprint...?

source: 진짜 가관이지!
en: you really are something!

source: 두눈 크게 뜨고 잘 지켜보도록
en: watch closely.

source: 지잉
en: whirrr

source: 텔레포트..
en: teleport...

source: 우리는 아직 전력을 다하지 못했다.
en: we haven’t gone all out yet.

source: 남은 내 역할은...{j}이걸 위해...
en: my remaining role in this is to...{j}

source: 드디어 내일이구나 내제자들이 천축에 도착하는 날
en: at last, tomorrow is the day my disciples will arrive in india.

source: 사람의 아들
en: son of man

source: 전대표 미겔 직접 임명 X세대 현 임시대표, 대표직의 권한으로 슈퍼패스 발동
en: i, the temporary leader of generation x, appointed by the former leader miguel, use a super pass.

source: 제천
en: ...jaecheon.

source: 웁!
en: hurgh!

source: 계속 떠오르게 한단 말이지...{j}녀석들과 함께 있으면.
en: I keep remembering those words when i’m with them...{j}

source: 성운의 움직임이...
en: the nebula's behaving strangely...

source: 내 곁에 오빠가 없을 것만 같아서...
en: ...i would wake up and he wouldn’t be there...

source: 계단?
en: stairs?

source: 크, 크윽!
en: u-ugh!

source: 나를 소환했다?
en: you summoned me?

source: 다부숴진 여의 마지막 개방
en: completely destroyed yeoui, final activation

source: 넌 네가 여래를 먹어치웠다고 생각하지만...
en: you think you’re the one who swallowed tathagata...

source: 박무봉!{j}진짜로 먹혀버린거냐?!
en: mubong! did it really happen?!{j}

source: 그 리더만 잡아내면...
en: if we can take down those leaders,

source: 다행이 힘의 전부를 잃은건 아냐.
en: luckily, we haven’t lost all our power.

source: 아찌 힘내.
en: hang in there, mister.

source: 빠지직
en: splat

source: 되려 잘됐구나...
en: this actually works in my favor...

source: 착륙좌표 확보!
en: landing coordinates acquired!

source: 저게 바로 너희가 도달하고, 넘어서야 할 경지란다.
en: that’s the level you must reach and surpass.

source: 내...
en: ...my...

source: 날개가...
en: the wings...

source: 빠이링!!
en: you got this!!!

source: 덕분에 딴딴해졌어!
en: i’m in much better shape now!

source: 벨제버브에게 패하고 반나절 후
en: half a day after losing to beelzebub...

source: 머엉
en: stare

source: 늦었다.{j}터뜨려버려.
en: you're too late. now, blast it open...{j}

source: 피해구역 폐쇄에 들어간다!
en: we’re sealing off the damaged area!

source: 문제는...
en: the problem is...

source: 혼자는 안가!
en: if I go, I’m not going alone!

source: 네 힘 잘써줄테니 너무 억울해 하진 마라.
en: but don’t feel too bad, because I’ll put your power to good use.

source: 쩍{j}번
en: flash{j}

source: 사탄은 힘의 크기로...
en: satan distinguishes between things...

source: 그래 당신..{j}아니 네가...
en: so you are...{j}

source: 츠{j}파
en: shwap

source: chapter 552
en: episode 552

source: 오,오빠..
en: m-mori...

source: 피해...
en: run...

source: 데려가지 않는다...
en: i said i wouldn’t be taking you with me...

source: 달려가는 오빠가...{j}너무 빨라서...
en: because mori ran so fast...{j}

source: 이별이 버틸만큼...
en: just enough to not break this planet...

source: 어떻게든 이 결계를 뚫을거임.
en: i’ll do whatever it takes to pierce this barrier.

source: 커져라
en: get bigger.

source: 울컥
en: hurgh

source: 고마워!
en: thanks!

source: 어느날 그곳에 그(녀)가 있었다.
en: one day, he just was.

source: 확실하게 부서주지.
en: this time, i’ll break you for good.

source: 오래 못버텨!
en: they won’t be able to hold out for long!

source: 닥치는대로 먹어치워!
en: eat everything in your path!

source: 나 대신...{j}너희가 가는게...
en: wouldn’t it be better for the two of you to go instead of me...?{j}

source: 느려진 시간에...
en: now, what happens when I add...

source: 박무봉!
en: mubong!

source: 높은곳으로 도망쳐!
en: escape to higher ground!

source: 무궁무진한
en: infinite.

source: 국보개화
en: national treasure blooming

source: 꽈악
en: clench

source: 우연과 우연이 만나...{j}기적같은 일이 벌어졌어.
en: a string of coincidences have created something of a miracle.{j}

source: 단순한 중력파?
en: or is it just a gravitational wave?

source: 모두가 나눠준 힘으로...
en: i'm gonna crush him...

source: 우웅
en: hum

source: 뭐지?
en: what’s this?

source: 이름.
en: her name.

source: 리더그룹 채집완료
en: I’m done collecting the leaders.

source: 차력발현
en: manifest borrowed power

source: 난...{j}네 선택을 존중한다...
en: i... respect your decision...{j}

source: 검
en: the way of the sword.

source: 이번에야말로 진짜 선지자 고기를 먹을 수 있겠구나.
en: it seems I will be able to taste the flesh of a real prophet this time.

source: 룡?
en: dragons?

source: Wi-fi 발현
en: active wi-fi

source: 무,무슨?!
en: wh-what?!

source: 아 그리고,
en: oh, and...

source: 쉴드가...
en: the shield...

source: 지금부터 발을 쓸게.
en: ...start using my legs.

source: 사탄과 싸우는 중에도 이쪽에 끊임없이 견제해온다!
en: he’s keeping us in check while fighting satan at the same time!

source: 웅
en: fwish

source: 리뉴얼 호미걸이
en: RE-TAEKWONDO HOMI-GEOLYI

source: 가져가.{j}우리의 힘도...
en: {j}take our strength, too...

source: 이기기 위해서...
en: in order to win...

source: 슛
en: fwish

source: 앗
en: sh

source: 변한...건가?
en: has something... changed?

source: 망가진 윤회의 서 최후의 힘
en: the book of the broken karmic cycle, and the last power...

source: 무지...ㄴ
en: park...

source: 나 역시 신에게 버림받은 몸
en: i was also forsaken by god.

source: 쿠구궁
en: rumble

source: 아직 멀었냐?{j}제천대성
en: do you still need more time, jaecheondaeseong?{j}

source: 박태진
en: taejin park.

source: 꺄악!
en: ahhh!

source: “미안하구나...”
en: “i’m sorry”...

source: 진화?!
en: are they evolving?!

source: 네 스스로 파기했던거 아닌가?
en: did you not destroy it with your own hands?

source: 행복한 미래를...!
en: build a happy future!

source: 번뇌煩雷
en: agonies

source: 제천대성 분신술
en: jaecheondaeseong duplication

source: 새로운 리더의 생성...{j}그리고 패턴 양상이 다양해졌다?!
en: the new leaders are forming... and their movement patterns are becoming more diverse?!{j}

source: 그렇구나....
en: i see...

source: 그 신화의 시작에...
en: and standing at the center of it all...

source: 사탕
en: this is candy

source: 이미...{j}인지의 범주를 훌쩍 뛰어넘었어.
en: he’s already way beyond comprehension...{j}

source: 오빠가 이름을 지어줘.
en: you should name her.

source: 시간이...
en: did...

source: 꼭..힘을 전해줘.
en: please... get him the energy.

source: 최승진 어 시 스 트 :
en: seungjin choi assistant:

source: 용사들!
en: our warriors!

source: 0.00000000000001%의 확률에 다다른다...
en: ...to make a 0.00000000000001% probability a reality...

source: 이정도 거리면, 나 역시 안심하고 전력을 낼 수 있을것 같군.
en: at this distance, i can rest easy and use my full power.

source: 그 순환의 순간을...{j}놓치지 않고, 빌린다.
en: and that’s when i’ll borrow it... right at the moment of transfer.

source: 이거리면 안심하고 전력을 낼 수 있어.
en: with this, you can also use your full power.

source: 556화
en: episode 556

source: 법사...
en: mage...

source: 내가...{j}어떻게?
en: {j}how... am i...?

source: 퍼{j}억
en: {j}thwack

source: 모든걸 버리고 여기까지 왔다.
en: i discarded everything to get to this point.

source: 후우웁!!
en: argh!!!

source: 다함이 없는...
en: ...means inexhaustible...

source: 어딨어?!
en: where are you?!

source: 그림자
en: shadow.

source: 우리 아직 못들어갔어!
en: we’re still out here!

source: 불.
en: light.

source: 내 눈 앞에서 사라질까봐...
en: ...that I thought he’d disappear before my eyes...

source: 뒤는 걱정하지마.
en: don’t worry about what comes next.

source: 사담은 나중에...
en: let's save chatting for later...

source: 다함이 없는 끝없이...
en: inexhaustible, limitless...

source: 조금만...
en: just a little longer...

source: 버티질 못합니다.
en: won’t be able to take it.

source: 한번 더다...{j}이 머저리들아...
en: one more time, you fools...{j}

source: 돌겠군...진짜...
en: how absurd...

source: 네 각오...{j}훌륭했다.
en: {j}i applaud your resolve...

source: 살아...
en: have i...

source: 혹시나 여래에게 먹힐까봐...?
en: afraid you’ll be swallowed up by tathagata...

source: 여래의 육체조각은 인간들에게 들러붙어 천천히 기다렸어.
en: the fragments of tathagata stuck to humans and bided their time.

source: 우릴 따라와라 사탄
en: follow us, satan.

source: 이런 위험한 상황에 내몰아서 미안해.
en: i’m sorry for putting you in danger like this.

source: 보이지...
en: I didn’t...

source: 지구에는 여래의 파편이 샅샅이 흩어졌어.
en: ...the pieces were scattered across the earth.

source: 어떻게든 살아남을테니까.
en: we’ll stay alive somehow.

source: 네 차력은 약하지 않아 모!
en: your power is nothing to scoff at, mo!

source: 가자!
en: let’s go!

source: 홀리..ㅅ..
en: holy... sh...

source: 거기서는 결국 ‘용’이 됐구나
en: you ended up becoming a dragon over there, huh...

source: 성녀의 십자가
en: saintess’s cross

source: 진모리...{j}너 혼자의 존재만으로도 역겨운데...
en: mori jin... just one of you is enough to make me sick...{j}

source: 배고파.
en: I’m hungry...

source: 아니, 그냥...
en: it’s nothing, just...

source: 무한증식 때문...
en: ...because they’re able to divide infinitely.

source: 진정한 절대신이 되기위해 중생(重生,거듭남)해야 한다.
en: ...i must be reborn in order to become the supreme god.

source: 신지구로 돌입하는 일체의 사상을 거부한다
en: i reject all of the ideas rushing into the new world.

source: 남조선...
en: my old enemy...

source: 12장의 날개
en: 12 wings

source: God of HIGHSCHOOL
en: the god of high school.

source: 아따끄.
en: attaque.

source: 그래...
en: i see...

source: 징
en: whish

source: 화아악
en: flare

source: 태양계주위를 도는 작은 천체 집합체
en: ...a small collection of celestial bodies that orbits the solar system.

source: 힘이 없으면 모든게 무의미해
en: everything is meaningless if you’re weak.

source: 박무봉의 딸...
en: mubong park’s daughter...

source: 직
en: crackle

source: 받거라...
en: take this...

source: 진짜로 먹혀버린거냐?!
en: mubong! did you really get eaten?!

source: 과거 천상대전에서 마왕군의 8할을 죽음으로 내몰았던 술식...!
en: ...the technique to kill 80 percent of the monster troops during the heavenly war...!

source: 돌입!
en: charge!

source: 타닷
en: dash

source: 너무 하잖아?
en: that’s going too far.

source: 키{j}잉
en: whoosh{j}

source: 넌 인간일까?
en: are you human?

source: 쏴아아아
en: shwaaa

source: 아..
en: ah...

source: 아니면...
en: or...

source: 한번 풀어 놓은 녀석들을 다시 거둬들이려면 상당히 애먹지...
en: once they’ve been let loose, it’s a hassle to round them back up...

source: 보고있나?
en: are you seeing this...

source: 부탁해.
en: help me out here.

source: 부탁..해..
en: i... leave...

source: 그런 것 때문에 내던지기엔 여래의 목숨은 너무 숭고합니다
en: to throw away on the nonsensical prophecy of the native god...

source: 이날을 기다렸다!!
en: I have been waiting for this day!!!

source: 이쪽 여래는...{j}최악이야.
en: this tathagata... is the worst.{j}

source: 아버지?!
en: father?!

source: 기적
en: miracle

source: 다차원이지만 한가지 공통점이 있지.
en: ...even though they’re from different dimensions, they have one thing in common.

source: 조정 완료.
en: adjustments complete.

source: 여래가 영면에 드셨다.
en: tathagata has entered his eternal slumber.

source: 생각 하는것 부터...
en: from the way you think...

source: 허억!
en: huff

source: 서둘러야겠군...
en: I should pick up the pace...

source: 1문자!
en: 1st letter!

source: 대머리는 더...
en: and bald ones even more...

source: 성간 뇌전
en: NEBULA THUNDERBOLT

source: 이제 우리 친구인거지?
en: we’re friends now, right?

source: 움직...여...
en: move... please...

source: 이미...{j}죽음은 각오하고 있었어.
en: {j}I was already... prepared to die.

source: 뭐?!
en: what?!

source: 불사의 육체
en: IMMORTAL BODY

source: 저희 쪽에선...{j}유미라씨와 전 백년가약을 맺었소.
en: back in my world... miss mira and I officially tied the knot.{j}

source: 잊었느냐?
en: have you forgotten?

source: ...뭐 답변은 않겠다만,
en: well... i won’t answer that...

source: 그녀석 얼마나 악랄한지....
en: you wouldn't believe how evil he is...

source: “그래...업”
en: that’s right... karma.

source: 주륵
en: drip

source: 조금이지만 힘을 쓸 수 있어!
en: it’s only a little, but we can still use our power!

source: 그게바로 너야
en: you.

source: 아직도...{j}전력이 아니야?!
en: he’s... still not using his full power?!{j}

source: 꽈득
en: crunch

source: 전부 줄게...{j}모두의 힘을...
en: everyone’s energy...{j}i’ll give it all to you...

source: 과연 그럴까?
en: but is that really true?

source: 548화
en: episode 548

source: 위험해!
en: dangerous!

source: 핑
en: SWOOSH

source: 내가 말했지?!
en: didn’t I tell you?!

source: 박무봉은 아직도 전력을 다하지 않고 있어!
en: mubong still isn’t using his full power!

source: 공간이 뒤틀린다.
en: space is warping.

source: 박용제 어 시 스 트 :
en: yongje park assistant:

source: 진짜...{j}가지가지 한다.
en: {j}i’m getting really tired of this.

source: 마치 처음부터 이 세상에 존재 하지 않았던 사람처럼...
en: ...as though he’d never even existed.

source: 이기면 뽀뽀해줄게!
en: if you win, i'll give you a kiss!

source: 모!
en: mo!!!

source: 흠칫
en: flinch

source: 그 깨달음을 안고, 죽어
en: take this lesson with you to the grave.

source: 내가 만든 지옥속에서...
en: ...in that hell i created...

source: 날 따라옴
en: i’m coming with you.

source: 어린애 한명 겨우 들여보낼 수 있는 작은 구멍 하나
en: we just need a hole big enough to send a baby through.

source: 돌입정지!
en: halt the charge!

source: 개쓰레기 잡신이...
en: you garbage, insignificant god...

source: 그들이 내려왔다...
en: ...they came down...

source: 우마왕
en: king uma.

source: 지구에서 인류가 보내준 에너지.
en: it’s the energy that the people on earth sent us.

source: 쾅!
en: bang

source: 힘이...
en: my strength...

source: 혼란스러워 하는 걸지도...
en: ...maybe you’re confused...

source: 받아보거라...
en: take this...

source: 여기 까진거군...
en: looks like this is his limit...

source: 갑판부 기압 정상화 완료
en: atmosphere on the deck is normalized.

source: 주르륵
en: drip

source: 저기 서있는 인상 더러운놈이 여래다.
en: everyone, that nasty-looking guy over there is tathagata.

source: 박무진이다.
en: it’s mujin park.

source: 슈{j}륵
en: swoosh{j}

source: 미안해...
en: i’m sorry...

source: 이 기운은?!
en: this energy is...?!

source: 처{j}억
en: whish{j}

source: 갑판으로 나감...
en: let’s go to the deck...

source: 고요
en: gasp

source: 제천대성 분신술 극의
en: jaecheondaeseong extreme duplication

source: 형님
en: brother!

source: 이 별이 버틸만큼만...
en: just enough to not break this planet...

source: 고오오
en: whoosh

source: 둘다 괜찮지?
en: you’re both okay, right?

source: 이쪽 여래는 작군.
en: your tathagata is tiny.

source: 무궁무진
en: infinite.

source: 아브비...마..
en: feew... bettuh...

source: 어째서...
en: why...

source: NOA가...
en: NOA...

source: 너 개인의 구원.
en: your own salvation.

source: 크아아!
en: arghhh!

source: 그 시작점을 지금 모두가 지켜보고 있다.
en: right now, all of us are watching it unfold.

source: 그 존재가 어디서 어떻게 태어났는지는 아무도 모른다.
en: no one knows where or how he was born.
